/******************************************************************************
* 
* Абрамян М. Э.
* For 16. Дано вещественное число A и целое число N (> 0). Используя один цикл, 
* вывести все целые степени числа A от 1 до N.
* (нужно возводить А в степень от 1 до N и выводить результат)
* 
*******************************************************************************/

#include <iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "ru");
	int N = 3;
	if (N <= 0) {
		cout << "N должно быть больше 0"s << endl;
		return 0;
	}
	double A = 2.5;
	double result = 1;
	for (size_t i = 1; i <= static_cast<size_t>(N); ++i) {
		result *= A;
		cout << result << " ";
	}

	return 0;
}