/******************************************************************************
*
* Абрамян М. Э.
* While 13. Дано число A (> 1). Вывести наименьшее из целых чисел K, для 
* которых сумма 1 + 1/2 + … + 1/K будет больше A, и саму эту сумму.
*
*******************************************************************************/

#include <iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "ru");
	double A = 1.7;
	if (A < 1) {
		cout << "N не является положительным"s << endl;
		return 0;
	}
	int K = 0;
	double sum = 0;
	while (sum < A) {
		sum += (1.0 / ++K);
	}
	cout << "K = "s << K << endl;
	cout << "Сумма = "s << sum << endl;
	return 0;
}