/******************************************************************************
* 
* Абрамян М. Э.
* For 40. Даны целые числа A и B (A < B). Вывести все целые числа от A до B 
* включительно; при этом число A должно выводиться 1 раз, число A + 1 должно 
* выводиться 2 раза и т. д.
* 
*******************************************************************************/

#include <iostream>
#include <cmath>

using namespace std;

int main() {
	setlocale(LC_ALL, "ru");

	int A = 2;
	int B = 5;
	if (A >= B) {
		cout << "A должно быть больше B"s << endl;
		return 0;
	}

	int count = 1;
	for (int i = A; i <= B; ++i) {
		for (int j = 0; j < count; ++j) {
			cout << i << " ";
		}
		++count;
		cout << endl;
	}

	return 0;
}