/******************************************************************************
*
* Абрамян М. Э.
* While 10. Дано целое число N (> 1). Найти наибольшее целое число K, при 
* котором выполняется неравенство 3^K < N.
*
*******************************************************************************/

#include <iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "ru");
	int N = 10;
	if (N < 1) {
		cout << "N не является положительным"s << endl;
		return 0;
	}
	int K = 0;
	int M = 3;

	while (M < N) {
		M *= 3;
		++K;
	}
	cout << "K = "s << K << endl;
	return 0;
}