/******************************************************************************
*
* Абрамян М. Э.
* While 19. Дано целое число N (> 0). Используя операции деления нацело и 
* взятия остатка от деления, найти число, полученное при прочтении числа N 
* справа налево.
*
*******************************************************************************/

#include <iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "ru");
	int N = 381;
	if (N < 0) {
		cout << "N должно быть неотрицательным"s << endl;
		return 0;
	}
	int result = 0;
	while (N > 0) {
		int tmp = N % 10;
		result = result * 10 + tmp;
		N /= 10;
	}
	cout << "Результат = "s << result << endl;
	return 0;
}