/******************************************************************************
*
* Абрамян М. Э.
* While 4. Дано целое число N (> 0). Если оно является степенью числа 3, то 
* вывести True, если не является — вывести False.
*
*******************************************************************************/

#include <iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "ru");
	
	int N = 19683;

	while (N >= 3) {
		N -= 3;
	}
	if (N == 0) {
		cout << "true"s << endl;
	} else {
		cout << "false"s << endl;
	}
	
	return 0;
}