/******************************************************************************
*
* Абрамян М. Э.
* While 17. Дано целое число N (> 0). Используя операции деления нацело и 
* взятия остатка от деления, вывести все его цифры, начиная с самой правой 
* (разряда единиц).
*
*******************************************************************************/

#include <iostream>

using namespace std;

int main() {
	setlocale(LC_ALL, "ru");
	int N = 124212;
	if (N < 0) {
		cout << "N должно быть неотрицательным"s << endl;
		return 0;
	}
	int tmp = 0;
	int value = 1;
	while (tmp != N) {
		tmp = N % (10 * value);
		cout << tmp / value;
		value *= 10;
	}
	
	return 0;
}